package com.dragulaxis;

public class Main {
    public static void main(String[] args) {
        // я бы тут просто последовательно написал команды
        // для работы конкретно этого приложения

        // ввести с консоли параметры почты (хост, порт, логин, пароль)
        // или enter если по умолчанию

        // параметры поставщика (.csv form OOO "Запчасти даром")

        // скачивание файла...
//        MailClient.download("Hello World");

        // загрузка файла в БД...
        // готово
    }
}
